//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2016, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************
//**********************************************************************
//<AMI_FHDR_START>
//
// Name:	RTCWakeup.UNI
//
// Description:	RTC Wakeup Form String Definitions.
//
//<AMI_FHDR_END>
//**********************************************************************
/=#
#include "VFR.uni"

#langdef   x-AMI "x-AMI"    // AMI Configuration Language

#string STR_ENABLED                             #language eng "Enabled"
#string STR_DISABLED                            #language eng "Disabled"

#string STR_S5_RTCWAKE_FORM                     #language eng "S5 RTC Wake Settings"
#string STR_S5_RTCWAKE_FORM_HELP                #language eng "Enable system to wake from S5 using RTC alarm"

#string STR_WAKE_ON_RTC_PROMPT                  #language eng "Wake system from S5"
                                                #language x-AMI "RTCW000"
#string STR_WAKE_ON_RTC_HELP                    #language eng "Enable or disable System wake on alarm event. Select FixedTime, system will wake on the hr::min::sec specified. Select DynamicTime , System will wake on the current time + Increase minute(s)"
#string STR_FIXED_TIME                          #language eng "Fixed Time"
#string STR_DYNAMIC_TIME                        #language eng "Dynamic Time"

#string STR_RTC_WAKEUP_HOUR_PROMPT              #language eng "Wake up hour"
                                                #language x-AMI "RTCW001"
#string STR_RTC_HOUR_HELP                       #language eng "select 0-23 For example enter 3 for 3am and 15 for 3pm"
#string STR_RTC_MIN_HELP                        #language eng "select 0-59 for Minute"
#string STR_RTC_SEC_HELP                        #language eng "select 0-59 for Second"

#string STR_RTC_WAKEUP_MINUTE_PROMPT            #language eng "Wake up minute"
                                                #language x-AMI "RTCW002"
#string STR_RTC_WAKEUP_SECOND_PROMPT            #language eng "Wake up second"
                                                #language x-AMI "RTCW003"

#string STR_RTC_WAKEUP_MINUTE_INCREASE_PROMPT   #language eng "Wake up minute increase"
                                                #language x-AMI "RTCW004"
#string STR_TIME_MINUTE_INCREASE_HELP           #language eng  "1 - 5"

//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2016, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************